Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The easiest way to setup users and roles for our example is to use the `security-properties-file` extension. This extension essentially allows users and roles to be defined in the main Quarkus configuration file - `application.properties`. For more information about this extension check xref:security-properties.adoc[the associated guide]. An example configuration would be the following:
ja_jp: この例でユーザーとロールを設定する最も簡単な方法は、 `security-properties-file` エクステンションを使用することです。このエクステンションにより、基本的に、ユーザーとロールをメインの Quarkus 設定ファイル (`application.properties`) で定義できます。このエクステンションの詳細については、xref:security-properties.adoc[the associated guide] を確認してください。設定例は以下のとおりです。

source: The easiest way to specify a query parameter is to annotate a client method parameter with the `@QueryParam` or the `@RestQuery`. The `@RestQuery` is equivalent of the `@QueryParam`, but with optional name. Additionally, it can be also used to pass query parameters as a `Map`, which is convenient if parameters are not known in advance.
ja_jp: クエリーパラメーターを指定する最も簡単な方法は、クライアントメソッドのパラメーターに `@QueryParam` または `@RestQuery` というアノテーションを付けることです。 `@RestQuery` は `@QueryParam` と同等ですが、名前を省略することができます。さらに、クエリーパラメーターを `Map` として 渡すこともでき、事前にパラメーターがわからない場合に便利です。

source: The easiest way to test a gRPC service is to use a gRPC client as described in xref:grpc-service-consumption.adoc[Consuming a gRPC Service].
ja_jp: gRPCサービスをテストする最も簡単な方法は、 xref:grpc-service-consumption.adoc[gRPCサービスの使用] で説明したように、gRPCクライアントを使用することです。

source: The easiest way to try Qute is to use the convenient `io.quarkus.qute.Qute` class and call one of its `fmt()` static methods that can be used to format simple messages:
ja_jp: Qute を試す最も簡単な方法は、便利な `io.quarkus.qute.Qute` クラスを使用し、簡単なメッセージをフォーマットするために使用できる `fmt()` 静的メソッドの 1 つを呼び出すことです。

source: The echo callback method can only be invoked if the current security identity has an `admin` role.
ja_jp: エコーコールバックメソッドは、現在のセキュリティーアイデンティティーに `admin` ロールがある場合にのみ呼び出すことができます。

source: The effectiveness of the generated cache depends on how representative your integration tests are of production startup and early traffic.
ja_jp: 生成されたキャッシュの有効性は、インテグレーションテストが本番環境の起動と初期トラフィックをどれだけ代表しているかに依存します。

source: The elements are stored in Elasticsearch.
ja_jp: 要素はElasticsearchに格納されます。

source: The elements are stored in MongoDB.
ja_jp: 要素はMongoDBに格納されています。

source: The elements used via reflection are not part of the call tree so they are dead code eliminated (if not called directly in other cases). To include these elements in your native executable, you need to register them for reflection explicitly.
ja_jp: リフレクションで使用される要素はコールツリーの一部ではないので、デッドコードとして排除されます (他のケースでは直接呼び出されない場合)。ネイティブ実行可能ファイルにこれらの要素を含めるには、リフレクションに明示的に登録する必要があります。

source: The elytron-security-properties-file extension currently supports two different realms for storing authentication and authorization information. Both support storage of this information in properties files.
ja_jp: elytron-security-properties-fileエクステンションは現在、認証と認可の情報を保存するための2つの異なるレルムをサポートしています。どちらもこの情報をプロパティファイルで保存することをサポートしています。

source: The elytron-security-properties-file extension currently supports two different realms for the storage of authentication and authorization information. Both support storage of this information in properties files. The following sections detail the specific configuration properties.
ja_jp: elytron-security-properties-file エクステンションは、現在、認証と認可情報の保存のための2つの異なる領域をサポートしています。どちらもこの情報のプロパティーファイルへの保存をサポートしています。以下のセクションでは、特定の設定プロパティーについて詳しく説明します。

source: The embedded coordinator will be available on the same port as the application (with path `lra-coordinator`), but note that the default coordinator port is `50000` so you will need to configure its location in the application config to tell the application to use it:
ja_jp: 埋め込まれたコーディネーターは、アプリケーションと同じポート（パス `lra-coordinator` ）で利用できますが、デフォルトのコーディネーターのポートは `50000` なので、アプリケーションのコンフィグでその場所を設定して、アプリケーションに使用させる必要があることに注意してください。

source: The embedded realm also supports mapping of users to password and users to roles. It uses the main `application.properties` Quarkus configuration file to embed this information. They are configured with properties starting with `quarkus.security.users.embedded`.
ja_jp: 埋め込まれたレルムは、ユーザーのパスワードへのマッピングやユーザーのロールへのマッピングもサポートしています。この情報を埋め込むには、メインの `application.properties` Quarkus設定ファイルを使用します。これらは、 `quarkus.security.users.embedded` で始まるプロパティーで設定されます。

source: The embedded realm also supports the mapping of users to passwords and users to roles. It uses the main `application.properties` Quarkus configuration file to embed this information. They are configured with properties starting with `quarkus.security.users.embedded`.
ja_jp: 組込レルムは、ユーザーとパスワード、ユーザーとロールのマッピングもサポートします。この情報を埋め込むには、メインの `application.properties` Quarkus設定ファイルを使用します。これらは、 `quarkus.security.users.embedded` で始まるプロパティで設定されます。

source: The embeddings are stored in a "Vector Store" for semantic similarity searches.
ja_jp: 埋め込みは、セマンティック類似性検索のために「Vector Store」に保存されます。

source: The emojis shown above may not match precisely. The appearance of emojis can vary with the font used or the terminal/environment. IntelliJ IDEA, for example, has several long-running issues open regarding the behavior/rendering of emojis in the terminal.
ja_jp: 上記の絵文字は、正確に一致しない場合があります。絵文字の見え方は、使用するフォントや端末・環境によって異なる場合があります。例えば、IntelliJ IDEAでは、ターミナルでの絵文字の動作やレンダリングに関して、いくつかの長期にわたる問題が残されています。

source: The empty expression `{}` is a placeholder that is replaced with an index-based array accessor, i.e. `{data[0]}`.
ja_jp: 空の式 `{}` はプレースホルダーであり、インデックスベースの配列アクセスサー (例えば `{data[0]}`) に置き換えられます。

source: The encrypted session cookie with up to three tokens may exceed a 4096 bytes cookie size limit, causing the browser to drop it. If it happens, Quarkus OIDC attempts to split the large session cookie into individual session cookie chunks by default and re-assemble them into a single session cookie when the user returns, before decrypting it. But you can try the `quarkus.oidc.token-state-manager.split-tokens=true` option in order to have one session cookie per token - where the main session cookie keeps an ID token, and two more session cookies - access and refresh tokens.
ja_jp: 最大 3 つのトークンを含む暗号化されたセッション Cookie は、4096 バイトの Cookie サイズ制限を超える可能性があり、ブラウザーによって破棄されることがあります。これが発生した場合、Quarkus OIDC はデフォルトで、巨大なセッション Cookie を個々の Cookie チャンクに分割し、ユーザーが戻ってきたときに復号する前にそれらを 1 つのセッション Cookie に再構築しようとします。しかし、`quarkus.oidc.token-state-manager.split-tokens=true` オプションを試して、トークンごとに 1 つのセッション Cookie を持たせることもできます。この場合、メインのセッション Cookie が ID トークンを保持し、さらに 2 つのセッション Cookie がアクセストークンとリフレッシュトークンを保持します。

source: The encryption key can be set using the `quarkus.http.auth.session.encryption-key` property, and it must be at least 16 characters long. This key is hashed using SHA-256 and the resulting digest is used as a key for AES-256 encryption of the cookie value. This cookie contains an expiry time as part of the encrypted value, so all nodes in the cluster must have their clocks synchronized. At one minute intervals a new cookie will be generated with an updated expiry time if the session is in use.
ja_jp: 暗号化キーは `quarkus.http.auth.session.encryption-key` プロパティーを使って設定でき、少なくとも 16 文字の長さでなければなりません。このキーは SHA-256 を使ってハッシュ化され、その結果のダイジェストがクッキー値の AES-256 暗号化のキーとして使用されます。このクッキーは暗号化された値の一部として有効期限を含んでいますので、クラスター内のすべての ノードはクロックを同期させなければなりません。1 分間隔で、セッションが使用中であれば、更新された有効期限時間を持つ新しいクッキーが生成されます。

source: The encryption key used to encrypt the value must be the same used to decrypt the value and set into `smallrye.config.secret-handler.aes-gcm-nopadding.encryption-key`.
ja_jp: 値の暗号化に使用された暗号化キーは、値の復号化に使用され、 `smallrye.config.secret-handler.aes-gcm-nopadding.encryption-key` に設定されたものと同じでなければなりません。

source: The encryption secret is recommended to be 32 chars long. For example, `quarkus.oidc.token-state-manager.encryption-secret=AyM1SysPpbyDfgZld3umj1qzKObwVMk`
ja_jp: 暗号化のシークレットは32文字にすることを推奨します。例えば `quarkus.oidc.token-state-manager.encryption-secret=AyM1SysPpbyDfgZld3umj1qzKObwVMk`

source: The end result is that a using Qute within a JAX-RS resource may look as simple as:
ja_jp: 最終的には、JAX-RSリソース内でQuteを使用すると、次のようにシンプルに見えるかもしれません。

source: The end result is that a using Qute within a Jakarta REST resource may look as simple as:
ja_jp: 最終的には、Jakarta REST リソース内で Qute を使用すると、次のようにシンプルになります。

source: The end result of the above configuration would be the following `env` part being applied the generated `Deployment`:
ja_jp: 上記の構成では、最終的に次のような `env` 部分が、生成された `Deployment` に適用されます。

source: The end result, including the imports, should look like the following:
ja_jp: インポートも含めて最終的には以下のようになるはずです。

source: The endpoint address will be \http://localhost:8080/hello, which must also be registered as an allowed callback URL in your Auth0 application.
ja_jp: エンドポイントアドレスは \http://localhost:8080/hello になります。これは、Auth0 アプリケーションで許可されたコールバック URL として登録する必要があります。

source: The endpoint allows users with the role denoted by the value of the `admin-role` property.
ja_jp: エンドポイントは、 `admin-role` プロパティーの値によって示されるロールを持つユーザーを許可します。

source: The endpoint for the logs exporter.
ja_jp: ログエクスポーターのエンドポイント。

source: The endpoint for the metrics exporter.
ja_jp: メトリクスエクスポーターのエンドポイント。

source: The endpoint for the traces exporter.
ja_jp: トレースエクスポーターのエンドポイント。

source: The endpoint is available on `/q/info` and will be exposed on the management network interface if you enable it.
ja_jp: エンドポイントは `/q/info` で利用可能で、有効にするとマネジメントネットワークインターフェイスで公開されます。

source: The endpoint obtains the user principal from the JAX-RS `SecurityContext`. This will be non-null for a secured endpoint.
ja_jp: エンドポイントは、JAX-RS `SecurityContext` からユーザー・プリンシパルを取得します。これは、保護されたエンドポイントの場合は非 null になります。

source: The endpoint obtains the user principal from the Jakarta REST `SecurityContext`. This returns `non-null` for a secured endpoint.
ja_jp: エンドポイントは、Jakarta REST `SecurityContext` からユーザープリンシパルを取得します。 これは、保護されたエンドポイントに対して `non-null` を返します。

source: The endpoint path is relative to the xref:http-reference.adoc#context-path[root context] configured by the `quarkus.http.root-path` (which is `/` by default). For example, if you add `quarkus.http.root-path=/api` to your `application.properties` then a client can connect to this endpoint using `http://localhost:8080/api/chat/the-name`.
ja_jp: エンドポイントパスは、 `quarkus.http.root-path` (デフォルトでは `/`) によって設定された xref:http-reference.adoc#context-path[root context] に対して相対的です。たとえば、 `application.properties` に `quarkus.http.root-path=/api` を追加すると、クライアントは `http://localhost:8080/api/chat/the-name` を使用してこのエンドポイントに接続できます。

source: The endpoint returns a `CompletionStage` indicating the asynchronous nature of the method. The `emitter.send` method returns a `CompletionStage<Void>` . The returned future is completed when the message has been written to Kafka. If the writing fails, the returned `CompletionStage` is completed exceptionally.
ja_jp: エンドポイントは、メソッドの非同期性を示す `CompletionStage` を返します。 `emitter.send` メソッドは `CompletionStage<Void>` を返します。 メッセージが Kafka に書き込まれると、返される future が完了します。 書き込みが失敗した場合、返された `CompletionStage` が例外扱いで完了します。

source: The endpoint sends the passed payload (from a `POST` HTTP request) to the emitter. The emitter's channel is mapped to a Kafka topic in the `application.properties` file:
ja_jp: エンドポイントは、渡されたペイロードを (`POST` HTTP リクエストから) エミッターに送信します。エミッターのチャネルは、 `application.properties` ファイルの Kafka トピックにマップされます。

source: The endpoint will allow users with the role denoted by the value of the `admin-role` property.
ja_jp: エンドポイントは、 `admin-role` プロパティの値で示されるロールを持つユーザーを許可します。

source: The entire `spec` module has been modernized to use Java records consistently. Previously, we had a mix of traditional classes and records across our domain model. Now all domain classes leverage records for immutability and conciseness, and all getters follow the same naming pattern:
ja_jp: `spec` モジュール全体が、Javaレコードを継続的に使用するように近代化されました。以前は、ドメインモデル全体で従来のクラスとレコードが混在していました。現在、すべてのドメインクラスは不変性と簡潔さのためにレコードを活用し、すべてのゲッターは同じ命名パターンに従います。

source: The entire application or a subset of it can be started with a single Docker Compose command.
ja_jp: アプリケーション全体またはそのサブセットを、1つのDocker Composeコマンドで起動することができます。

source: The entire request body in a temporary file
ja_jp: 一時ファイル内のリクエストボディ全体

source: The entire request body, decoded
ja_jp: デコードされたリクエストボディ全体

source: The entire request body, not decoded
ja_jp: デコードされていないリクエストボディ全体

source: The entities are stored and indexed in an Elasticsearch cluster.
ja_jp: エンティティーは Elasticsearch クラスターに保存され、インデックスが作成されます。

source: The entities are stored in a PostgreSQL database and indexed in an Elasticsearch cluster.
ja_jp: エンティティはPostgreSQLデータベースに格納され、Elasticsearchクラスターにインデックスされます。

source: The entity makes use of xref:hibernate-orm-panache.adoc[Panache], a layer on top of Hibernate ORM. Extending `PanacheEntity` brings in a range of methods for reading, writing, and finding data. Because all the data access methods are on the `Greeting` entity, rather than on a separate data access class, this is an example of the active record pattern.
ja_jp: このエンティティーは、Hibernate ORM の上のレイヤーである xref:hibernate-orm-panache.adoc[Panache] を使用します。 `PanacheEntity` を拡張すると、データの読み取り、書き込み、検索のためのさまざまなメソッドが導入されます。 すべてのデータアクセスメソッドは、別のデータアクセスクラスではなく、 `Greeting`エンティティー上にあるため、 これはアクティブレコードパターンの例です。

source: The entries are relative to the root of the generated Uber-Jar. You can specify multiple entries by adding extra `--ignored-entry` arguments.
ja_jp: エントリーは、生成された Uber-Jar のルートからの相対的なものです。追加の `--ignored-entry` 引数を追加することで、複数のエントリーを指定することができます。

source: The entry point always needs to be `io.quarkus.funqy.gcp.functions.FunqyBackgroundFunction` as it will be this class that will bootstrap Quarkus.
ja_jp: Quarkus をブートストラップするのはこのクラスなので、エントリーポイントは常に `io.quarkus.funqy.gcp.functions.FunqyBackgroundFunction` である必要があります。

source: The entry point always needs to be `io.quarkus.funqy.gcp.functions.FunqyCloudEventsFunction` as it will be this class that will bootstrap Quarkus.
ja_jp: Quarkus をブートストラップするのはこのクラスなので、エントリーポイントは常に `io.quarkus.funqy.gcp.functions.FunqyBackgroundFunction` である必要があります。

source: The entry point must always be set to `io.quarkus.gcp.functions.QuarkusBackgroundFunction` as this is the class that integrates Cloud Functions with Quarkus.
ja_jp: エントリーポイントは常に `io.quarkus.gcp.functions.QuarkusBackgroundFunction` に設定する必要があります。このクラスはQuarkusとCloud Functionsを統合するクラスです。

source: The entry point must always be set to `io.quarkus.gcp.functions.QuarkusCloudEventsFunction` as this is the class that integrates Cloud Functions with Quarkus.
ja_jp: エントリーポイントは常に `io.quarkus.gcp.functions.QuarkusCloudEventsFunction` に設定する必要があります。これは、Cloud Functions と Quarkus を統合するクラスです。

source: The entry point must always be set to `io.quarkus.gcp.functions.QuarkusHttpFunction` as this is the class that integrates Cloud Functions with Quarkus.
ja_jp: エントリーポイントは常に `io.quarkus.gcp.functions.QuarkusHttpFunction` に設定する必要があります。このクラスはQuarkusとCloud Functionsを統合するクラスです。

source: The entry point must always be set to `io.quarkus.gcp.functions.http.QuarkusHttpFunction` as this is the class that integrates Cloud Functions with Quarkus.
ja_jp: このクラスはCloud FunctionsとQuarkusを統合するクラスであるため、エントリーポイントは常に `io.quarkus.gcp.functions.http.QuarkusHttpFunction` に設定する必要があります。

source: The environment executing step `1` only needs Java and Maven (or Gradle) installed, while the environment executing step `3` only needs a GraalVM installation (including the `native-image` feature).
ja_jp: ステップ `1` を実行する環境には、Java と Maven (または Gradle) のみインストールされている必要がありますが、ステップ `3` を実行する環境には GraalVM のインストール (`native-image` 機能を含む) のみが必要です。

source: The equivalent with gradle:
ja_jp: gradleでの同等コマンド:

source: The error code
ja_jp: エラーコード

source: The error handler is invoked in case of the authorization failure.
ja_jp: 認可に失敗した場合はエラーハンドラーが呼び出されます。

source: The error message is explicit. But, it rarely makes us happy when we have such a wall of text printed in our terminal.
ja_jp: エラーメッセージは明示的です。しかし、このような壁のようなテキストがターミナルに印刷されていても、私たちが満足することはほとんどありません。

source: The error messages point to the code in the example, but it can be suprising that a reference to `DnsClient` appears. Why is that? The key is in what happens inside `KeyPairGenerator.initialize()` method call. It uses `JCAUtil.getSecureRandom()` which is why this is problematic, but sometimes the tracing options can show some stack traces that do not represent what happens in reality. The best option is to dig through the source code and use tracing output for guidance but not as full truth.
ja_jp: エラーメッセージは例にあるコードを指していますが、 `DnsClient` への参照が表示されるのは意外なことかもしれません。なぜでしょうか? 重要なのは、 `KeyPairGenerator.initialize()` メソッド呼び出し内で起こっていることです。これは `JCAUtil.getSecureRandom()` を使用し、これが原因で問題となっていますが、トレースオプションは、実際に起きていることを表さないスタックトレースの一部を表示することがあります。最良のオプションは、ソースコードを調べ、トレース出力を完全な事実としてではなく、ガイダンスとして使用することです。

source: The error messages point to the code in the example, but it can be surprising that a reference to `DnsClient` appears. Why is that? The key is in what happens inside `KeyPairGenerator.initialize()` method call. It uses `JCAUtil.getSecureRandom()` which is why this is problematic, but sometimes the tracing options can show some stack traces that do not represent what happens in reality. The best option is to dig through the source code and use tracing output for guidance but not as full truth.
ja_jp: エラーメッセージは例にあるコードを指していますが、 `DnsClient` への参照が表示されるのは意外なことかもしれません。なぜでしょうか? 重要なのは、 `KeyPairGenerator.initialize()` メソッド呼び出し内で起こっていることです。これは `JCAUtil.getSecureRandom()` を使用し、これが原因で問題となっていますが、トレースオプションは、実際に起きていることを表さないスタックトレースの一部を表示することがあります。最良のオプションは、ソースコードを調べ、トレース出力を完全な事実としてではなく、ガイダンスとして使用することです。

source: The essence of distributed systems resides in the interaction between services.
ja_jp: 分散システムの本質は、サービス間の相互作用にあります。

source: The essence of distributed systems resides in the interaction between services. In modern architecture, you often have multiple instances of your service to share the load or improve the resilience by redundancy. But how do you select the best instance of your service? That's where https://smallrye.io/smallrye-stork[SmallRye Stork] helps. Stork is going to choose the most appropriate instance. It offers:
ja_jp: 分散システムの本質は、サービス間の相互作用にあります。現代のアーキテクチャでは、負荷を共有したり、冗長性によって回復力を高めたりするために、サービスの複数のインスタンスを持つことがよくあります。しかし、サービスの最適なインスタンスをどのように選択すればよいのでしょうか？そこで、 link:https://smallrye.io/smallrye-stork[SmallRye Stork]がお役に立ちます。Storkが最適なインスタンスを選択してくれます。次の機能を提供します:

source: The evaluated template is parsed and evaluated every time the section is executed. In other words, it is not possible to cache the parsed value to conserve resources and optimize performance.
ja_jp: 評価済みテンプレートは、セクションが実行されるたびに解析および評価されます。 つまり、リソースを節約してパフォーマンスを最適化するために、解析された値をキャッシュすることはできません。

source: The evaluated template is parsed and evaluated every time the section is executed. In other words, it's not possible to cache the parsed value to conserve resources and optimize the performance.
ja_jp: 評価済みテンプレートは、セクションが実行されるたびに解析され評価されます。つまり、リソースを節約してパフォーマンスを最適化するために、解析された値をキャッシュすることはできません。

source: The event-loop threads (also called IO threads) are responsible for actually performing all the IO operations in an asynchronous way, and to trigger any listener interested in the completion of those IO operations.
ja_jp: イベントループスレッド (IO スレッドとも呼ばれます) は、すべての IO 操作を非同期で実際に実行し、それらの IO 操作の完了に関心のあるリスナーをトリガーする役割を果たします。

source: The events are also called in _dev mode_ between each redeployment.
ja_jp: また、各再配置の間に _開発モード_ でイベントが呼び出されます。

source: The evolution of Java
ja_jp: Javaの進化

source: The exact amount of requests allowed to the replica at a time
ja_jp: レプリカに対して一度に許可される正確なリクエスト量

source: The exact configuration is:
ja_jp: 具体的な構成例:

source: The exact path pattern `/forbidden` in the example above also secures the `/forbidden/` path. This way, the `forbidden` endpoint in the example below is secured by the `deny1` permission.
ja_jp: 上記の例の正確なパスパターン `/forbidden` は、 `/forbidden/` パスも保護します。 このようにして、以下の例の `forbidden` エンドポイントは `deny1` 権限によって保護されます。

source: The exact process depends on the JVM version being used as newer JVM have incrementally made the process easier.
ja_jp: 新しいJVMが段階的にプロセスを容易にしているため、正確なプロセスは使用するJVMのバージョンに依存します。

source: The exact process depends on the JVM version being used, as newer JVM have incrementally made the process easier.
ja_jp: 正確なプロセスは、使用されている JVM のバージョンによって異なります。新しい JVM は、プロセスを段階的に容易にしてきたからです。

source: The example above assumes you know the link to use at build time. There might be cases where you only know this at runtime. In that case, you can use a <<JsonRPC>> Method that returns the link to add, and use that when creating the link. Rather than using the `.url` method on the page builder, use the `.dynamicUrlJsonRPCMethodName("yourJsonRPCMethodName")`.
ja_jp: 上記の例では、ビルド時に使用するリンクが判明していることを前提としていますが、そうでないこともあります。その場合は、追加するリンクを返す <<JsonRPC>> を使用できます。これは、リンクの作成時に使用します。ページビルダーで `.url` メソッドを使用する代わりに、 `.dynamicUrlJsonRPCMethodName("yourJsonRPCMethodName")` を使用します。

source: The example above assumes you know the link to use at build time. There might be cases where you only know this at runtime. In that case, you can use a JsonRPC Method (discussed later) that returns the link to add, and use that when creating the link. Rather than using the `.url` method on the page builder, use the `.dynamicUrlJsonRPCMethodName("yourJsonRPCMethodName")`.
ja_jp: 上記の例では、ビルド時に使用するリンクが判明していることを前提としていますが、ランタイム時にのみリンクがわかる場合もあります。その場合は、追加するリンクを返す JsonRPC メソッド (後述) を使用し、リンク作成時にそれを利用できます。ページビルダーで `.url` メソッドを使用する代わりに、 `.dynamicUrlJsonRPCMethodName("yourJsonRPCMethodName")` を使用します。

source: The example above can be rewritten with an anonymous class:
ja_jp: 上記の例は、匿名クラスを使用して書き直すことができます。

source: The example above obtains an access token for user `alice`.
ja_jp: 上記の例では、ユーザー `alice` のアクセストークンを取得しています。

source: The example also shows that when an LRA is present its identifier can be obtained by reading the request headers via the `@HeaderParam` JAX-RS annotation type.
ja_jp: また、この例では、LRAが存在する場合、 `@HeaderParam` JAX-RSアノテーションタイプを介してリクエストヘッダを読み取ることで、その識別子を取得できることを示しています。

source: The example also shows that when an LRA is present its identifier can be obtained by reading the request headers via the `@HeaderParam` Jakarta REST annotation type.
ja_jp: また、この例では、LRAが存在する場合、 `@HeaderParam` Jakarta RESTアノテーションタイプを使用してリクエストヘッダを読み取ることで、その識別子を取得することができることを示しています。

source: The example application follows a clean architecture pattern with separated concerns:
ja_jp: このサンプルアプリケーションは、関心事が分離されたクリーンアーキテクチャパターンに従っています。

source: The example below configure the generator `org.quartz.simpl.HostnameInstanceIdGenerator` named as `hostname`, so you can use its name as `instance-id` to be used. That generator uses just the machine hostname and can be appropriate in environments providing unique names for the nodes.
ja_jp: 以下の例では、ジェネレーター `org.quartz.simpl.HostnameInstanceIdGenerator` を `hostname` という名前で構成しているので、その名前を `instance-id` として使用することができます。このジェネレーターはマシンのホスト名だけを使用し、ノードに一意な名前を提供する環境では適切なものとなります。

source: The example below produces 5 (JSON) strings, but the _order_ of the strings in the returned JSON array is not guaranteed. The below example also works for JSON objects and not just simple types.
ja_jp: 以下の例では 5 つの (JSON) 文字列が生成されますが、返される JSON 配列内の文字列の _順序_ は 確保されません。以下の例は、単純な型だけでなく、JSON オブジェクトでも機能します。

source: The example below produces 5 (JSON) strings, that are not wrapped in an array, like this:
ja_jp: 以下の例では、このように配列にラップされていない5つの（JSON）文字列を生成します：

source: The example below registers the plugin `org.quartz.plugins.history.LoggingJobHistoryPlugin` named as `jobHistory` with the property `jobSuccessMessage` defined as `Job [{1}.{0}] execution complete and reports: {8}`
ja_jp: 以下の例では、 `jobHistory` というプラグインを `org.quartz.plugins.history.LoggingJobHistoryPlugin` という名前で登録し、プロパティー `jobSuccessMessage` を `Job [{1}.{0}] execution complete and reports: {8}` として定義します。
